# Задайте натуральное число N.
# Напишите программу, которая составит список простых множителей числа N.

n = int(input('Введите натуральное число: '))
b = 2
lst = []
while n > 1:
    if n%b == 0:
        lst.append(b)
        n = n/b
    else:
        b += 1
print(lst)
