# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

str = input('Введите последовательность чисел через пробел: ')
lst1 = str.split(sep=' ')
lst2 = [i for i in lst1 if lst1.count(i) < 2]
print(f'Список неповторяющихся элементов = {lst2}')
